Repository: pombredanne/whois-debian
Catalog: src/po/*.po
Languages: fi

source: Version %s. Report bugs to %s.
fi: Versio %s. L‰het‰ bugiraportit osoitteeseen %s.

source: Using server %s.
fi: K‰ytet‰‰n palvelinta %s.

source: This TLD has no whois server, but you can access the whois database at
fi: T‰lla TLD:ll‰ ei ole whois palvelinta, tiedot ovat nakyviss‰ osoitteessa

source: This TLD has no whois server.
fi: T‰lla TLD:ll‰ ei ole whois palvelinta.

source: No whois server is known for this kind of object.
fi: Kysytty ei vastaa minkaan whois palvelun tiet‰miin tietoihin.

source: Unknown AS number or IP network. Please upgrade this program.
fi: Tuntematon AS-numero tai IP-verkko. P‰ivit‰ t‰m‰ ohjelma.

source: Querying for the IPv4 endpoint %s of a 6to4 IPv6 address.
fi: Kysyt‰‰n IPv4 ulostulona %s IPv6:n IPv4 avaruudesta.

source: Querying for the IPv4 endpoint %s of a Teredo IPv6 address.
fi: Kysyt‰‰n IPv4 ulostulona %s Teredo IPv6 tunneliosoitetta.

source: Query string: "%s"
fi: Kysely: "%s"

source: Found a referral to %s.
fi: Lˆytyi viittaus %s.

source: Cannot parse this line: %s
fi: Ohjelma ei kykene tulkitsemaan rivi‰: %s

source: Warning: RIPE flags used with a traditional server.
fi: Varoitus: k‰yt‰t RIPE valitsimia traditionaaliseen palvelimeen.

source: Catastrophic error: disclaimer text has been changed. Please upgrade this program.
fi: Katastrofaalinen virhe: lisenssiteksti on muuttunut. P‰ivita ohjelma.

source: Host %s not found.
fi: Palvelinta %s ei lˆydy.

source: %s/tcp: unknown service
fi: %s/tcp: tuntematon versio

source: Timeout.
fi: Aikakatkaisu.

source: Interrupted by signal %d...
fi: Ohjelma keskeytyi signaaliin %d...

source: Usage: whois [OPTION]... OBJECT... -l one level less specific lookup [RPSL only] -L find all Less specific matches -m find first level more specific matches -M find all More specific matches -c find the smallest match containing a mnt-irt attribute -x exact match [RPSL only] -d return DNS reverse delegation objects too [RPSL only] -i ATTR[,ATTR]... do an inverse lookup for specified ATTRibutes -T TYPE[,TYPE]... only look for objects of TYPE -K only primary keys are returned [RPSL only] -r turn off recursive lookups for contact information -R force to show local copy of the domain object even if it contains referral -a search all databases -s SOURCE[,SOURCE]... search the database from SOURCE -g SOURCE:FIRST-LAST find updates from SOURCE from serial FIRST to LAST -t TYPE request template for object of TYPE ('all' for a list) -v TYPE request verbose template for object of TYPE -q [version|sources|types] query specified server info [RPSL only] -F fast raw output (implies -r) -h HOST connect to server HOST -p PORT connect to PORT -H hide legal disclaimers --verbose explain what is being done --help display this help and exit --version output version information and exit
fi: K‰yttˆ: whois [OPTIO]... OBJEKTI... -l tasoa ep‰tarkempi osuma [ainoastaan RPSL] -L etsi kaikki ep‰tarkemmat osumat -m etsi yht‰ tasoa tarkemmat osumat -M etsi kaikki tarkemmat osumat -c etsi v‰h‰isin, joka vastaa mnt-irt attribuuttia -x t‰ydellinen osuma [ainoastaan RPSL] -d palauta ainoastaan k‰‰nteisdomainit [ainoastan RPSL] -i ATTR[,ATTR]... k‰‰nteiskysely ATTRibuutin perusteella -T TYPE[,TYPE]... etsi ainoastaan m‰‰ritetyn tyyppisi‰ objekteja -K palauta ainoastan hakuavaimet [ainoastan RPSL] -r ‰l‰ k‰yt‰ rekursiivista kontaktietohakua -R pakota k‰ytt‰m‰‰n paikallista kopiota domain objektista, vaikka se sis‰lt‰isi viitteit‰ -a etsi kaikista tietokannoista -s SOURCE[,SOURCE]... etsi tietokannoista SOURCE -g SOURCE:FIRST-LAST lˆytˆ p‰ivitt‰‰ l‰hteen SOURCE j‰rjestysnumeron FIRST:st‰ LAST:iin -t TYPE pyyd‰ mallinne TYPE objektille ('all' n‰ytt‰‰ tyyppilistan) -v TYPE monisanainen mallinne TYPE objektille -q [version|sources|types] erityinen palvelintieto [ainostaan RPSL] -F nopea tuloste (sis‰lt‰‰ -r valitsimen) -h HOST kysy palvelimelta HOST -p PORT k‰yt‰ TCP-porttia PORT -H ‰l‰ tulosta k‰yttˆehtoja --verbose selit‰‰ mit‰ tapahtuu --help tulosta t‰m‰ ruutu --version tulosta versio

source: standard 56 bit DES-based crypt(3)
fi: Standardi DES-salaus ks crypt(3)

source: Invalid method '%s'.
fi: V‰‰r‰ metodi '%s'.

source: Invalid number '%s'.
fi: V‰‰r‰ numero '%s'.

source: Try '%s --help' for more information.
fi: K‰yt‰ valitsinta '%s --help' lis‰tietojen saamiseen.

source: Wrong salt length: %d byte(s) when %d expected.
fi: V‰‰r‰ suolan pituus: %d tavu(a), kun %d tavua odotettiin.

source: Illegal salt character '%c'.
fi: Suolassa laiton merkki '%c'.

source: Password:
fi: Salasana:

source: Illegal password character '0x%hhx'.
fi: Laiton merkki salasanassa '0x%hhx'.

source: Method not supported by crypt(3).
fi: Toiminto ei ole tuettu crypt(3) funktiossa.

source: Usage: mkpasswd [OPTIONS]... [PASSWORD [SALT]] Crypts the PASSWORD using crypt(3).
fi: K‰yttˆ: mkpasswd [OPTIO] ... [SALASANA] [SUOLA]] Salaa salasanan crypt(3) funktiolla.

source: -m, --method=TYPE select method TYPE -S, --salt=SALT use the specified SALT -R, --rounds=NUMBER use the specified NUMBER of rounds -P, --password-fd=NUM read the password from file descriptor NUM instead of /dev/tty -s, --stdin like --password-fd=0 -h, --help display this help and exit -V, --version output version information and exit If PASSWORD is missing then it is asked interactively. If no SALT is specified, a random one is generated. If TYPE is 'help', available methods are printed. Report bugs to %s.
fi: -m, --method=TYPE valitse toiminto TYPE -S, --salt=SUOLA suolan valinta -R, --rounds=NUMERO pyˆrist‰ numeroon -P, --password-fd=NUM lue salasana avoimesta tiedostosta NUM ‰l‰k‰ terminaalista /dev/tty -s, --stdin sama kuin --password-fd=0 -h, --help tulosta t‰m‰ ruutu -V, --version tulosta versio Ellei salasanaa m‰‰ritet‰ se kysyt‰‰n. Ellei suolaa m‰‰ritet‰ k‰ytet‰‰n satunnaista. Jos tyyppi on 'help', tulostetaan toiminnot. L‰het‰ bugiraportit osoitteeseen %s.

source: Available methods:
fi: K‰ytett‰viss‰ olevat toiminnot:
